src/Documents/ПриказОМатериальнойПомощи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПриказОМатериальнойПомощи</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВСоответствии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатериальнаяПомощь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолБазовыхВеличин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеВыплаты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ознакомление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьСумму</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоощрения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Поощрения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипВзыскания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПриказОМатериальнойПомощи/Ext/ObjectModule.bsl
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
		
	Возврат СтруктураПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		Для Каждого стр из РаботникиОрганизации Цикл 
		ФизЛицоСтр = стр.ФизЛицо.ПолучитьОбъект();
		Если МатериальнаяПомощь = 1 Тогда 
			МассивФизЛ = ФизЛицоСтр.Поощрения.НайтиСтроки(Новый Структура("ДатаПоощрения,НомерПриказаПоощрения",ДатаПриказа,НомерПриказа));
			Если МассивФизЛ.Количество()=0 Тогда 
				НоваяСтрТабл  = ФизЛицоСтр.Поощрения.Добавить();
			иначе
				НоваяСтрТабл = МассивФизЛ[0];
			КонецЕсли;
			НоваяСтрТабл.ДатаПоощрения = ДатаПриказа;
			НоваяСтрТабл.НомерПриказаПоощрения = НомерПриказа;
			НоваяСтрТабл.ТекстПоощрения = стр.Текст;
			НоваяСтрТабл.ТипПоощрения = стр.ТипПоощрения;
			
			//Аверсон ЕАЕ 25.02.2025 СВФР-014999
			Если Организация.ИНН = "700103211" Тогда
				НоваяСтрТабл.ПримечаниеПоощрения = стр.Примечание;	
			КонецЕсли;
			//Аверсон СВФР-014999
			
			ФизЛицоСтр.Записать();
		ИначеЕсли МатериальнаяПомощь = 2 Тогда //взыскания
			МассивФизЛ = ФизЛицоСтр.Взыскания.НайтиСтроки(Новый Структура("ДатаВзыскания,НомерПриказаВзыскания",ДатаПриказа,НомерПриказа));
			Если МассивФизЛ.Количество()=0 Тогда 
				НоваяСтрТабл  = ФизЛицоСтр.Взыскания.Добавить();
			иначе
				НоваяСтрТабл = МассивФизЛ[0];
			КонецЕсли;
			НоваяСтрТабл.ДатаВзыскания = ДатаПриказа;
			НоваяСтрТабл.НомерПриказаВзыскания = НомерПриказа;
			НоваяСтрТабл.ТекстВзыскания = стр.Текст;
			НоваяСтрТабл.ТипВзыскания = стр.ТипВзыскания;
			
			//Аверсон ЕАЕ 25.02.2025 СВФР-014999
			Если Организация.ИНН = "700103211" Тогда
				НоваяСтрТабл.ПримечаниеВзыскания = стр.Примечание;	
				
				НоваяСтрТабл.ДатаВзыскания1 = ДатаПриказа;
				НоваяСтрТабл.СрокИстечения = Дата(Год(ДатаПриказа) + 1, Месяц(ДатаПриказа), День(ДатаПриказа), Час(ДатаПриказа), Минута(ДатаПриказа), Секунда(ДатаПриказа));
			КонецЕсли;
			//Аверсон СВФР-014999
			
			ФизЛицоСтр.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//Аверсон 26.06.2019 КВВ СВФР-004477 (
	Для Каждого стр из РаботникиОрганизации Цикл 
		ФизЛицоСтр = стр.ФизЛицо.ПолучитьОбъект();
		Если МатериальнаяПомощь = 1 Тогда 
			МассивФизЛ = ФизЛицоСтр.Поощрения.НайтиСтроки(Новый Структура("ДатаПоощрения,НомерПриказаПоощрения",ДатаПриказа,НомерПриказа)); 
			Для Каждого Стр2 Из МассивФизЛ Цикл 
				ФизЛицоСтр.Поощрения.Удалить(Стр2); 
			КонецЦикла; 
			ФизЛицоСтр.Записать(); 
			Сообщить("Удалена строка в спр.""Физические лица"" из таблицы ""Поощрения"" по сотруднику " + СокрЛП(стр.ФизЛицо));
		ИначеЕсли МатериальнаяПомощь = 2 Тогда //взыскания
			МассивФизЛ = ФизЛицоСтр.Взыскания.НайтиСтроки(Новый Структура("ДатаВзыскания,НомерПриказаВзыскания",ДатаПриказа,НомерПриказа)); 
			Для Каждого Стр2 Из МассивФизЛ Цикл 
				ФизЛицоСтр.Взыскания.Удалить(Стр2); 
			КонецЦикла; 
			ФизЛицоСтр.Записать(); 
			Сообщить("Удалена строка в спр.""Физические лица"" из таблицы ""Взыскания"" по сотруднику " + СокрЛП(стр.ФизЛицо));
		КонецЕсли;
	КонецЦикла;	
	//Аверсон 26.06.2019 КВВ СВФР-004477 )
КонецПроцедуры

//Аверсон ЕАЕ 26.08.2025 СВФР-016444
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации,, "Физлицо");
КонецПроцедуры
//Аверсон СВФР-016444
